tutorials/compressible/rhoCentralFoam/shockTube/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat       raw;

surfaceFormat   vtk;

sets
(
    line
    {
        type    face;
        axis    x;
        start   ( -5 0 0 );
        end     ( 5 0 0 );
        nPoints 100;
    }
);

surfaces        ();

fields          ( p U.component(0) T rho );


// ************************************************************************* //
